Revit 2027 API
BuiltInFailures.RebarShapeFailures.DepthDimensionNotExisted Property
 Multi-planar shape's depth dimension has been deleted. Please assign a new one to multi-planar depth.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DepthDimensionNotExisted { get; }
Public Shared ReadOnly Property DepthDimensionNotExisted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DepthDimensionNotExisted {
	FailureDefinitionId^ get ();
}
static member DepthDimensionNotExisted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace